# About
about_title=About
content=86MEはオープン　ソース　プロジェクトです。Roboardの魔のRoBoMEから派生します。(https://github.com/RoBoardGod/RoBoME)
author_label_Text=著者：RoBoardGod
license_label_Text=ライセンス：GNU GPL V2
version_label_Text=バージョン：2.0.0, 2017/06/29
language=ja
# Main
aboutToolStripMenuItem_Text=About
acc_groupBox_Text=加速度計
Action_groupBox_Text=アクション
ActionList_Text=リスト
actionToolStripMenuItem_Text=プロジェクトを開く
AddHomeframe=ホームフレームを付け加える
AddNewAction_F=リストの上に新しいコマンドを付け加える
AddNewAction_N=アクションの下に新しいコマンドを付け加える
AdvanceTab_Text=Advanced
AlwaysOff_ToolTip=この動きがいつも実行しません
AlwaysOn_ToolTip=この動きがいつも実行します
analog_groupBox_Text=Analog
autocheck_Text=Sync Servos
autocheck_ToolTip=編集するのとき、サーボモータも同期します。
blockingExplaination_Text=この動きが他の動きに中断されることができない。
bt_groupBox_Text=Bluetooth
btBaudCombo_ToolTip=Bluetoothのボーレートを選んでください。
btKeyText_ToolTip=動きを起こすのコードを設定してください。
btModeCombo_ToolTip=OneShot: ひとつ信号で一回だけ実行しまる\nContinuous: ひとつ信号でずっと実行する、キャンセルされるまで。
btPortCombo_ToolTip=86DuinoにBluetoothで連結するのシリアルポートを選ぶ。
call_radioText=ターゲット動きをコール
capturebutton_Text=位置をゲット
capturebutton_ToolTip=注意！この操作はまず全てのサーボモータの位置をゲット、そして全てのサーボモータをフリー。この操作はKONDOサーボのみできる。
CodeGenTab_Text=Code Generation
commandsToolStripMenuItem_Text=起こす指令を編集する
CompRangeExplanation_Text=IMUの補償角度を有効な範囲に（０～１８０度、０でごの関数を閉じます）設定してください。IMU補償がこの角度に作動します（ー設定した角度～+設定した角度）。
MotionControlExplanation_Text=動きの軌道計画方法を選んでください。
DeleteAction=削除する
DeleteMotion=動きを削除
DuplicateFrame=複写する
DuplicateMotion=動きを複製
EditMotion_ToolTip=オプション
editToolStripMenuItem_Text=ロボット コンフィギュレーション
errorMsg1=メッセージを発信することはできない。連接を確認する、そしてもう一度実行してください。
errorMsg2=86Duinoは実行できない、オフラインモードを実行する。
errorMsg3=画像を開くことができない、ファイルを確認してください。
errorMsg4=ファイルのタイプはrmbではないから、開くことができない。
errorMsg5=ファイルが壊れた、開くことができない。
errorMsg6=ファイルが壊れた、オフセットのフォーマットを確認してください。
errorMsg7=ファイルが壊れた、homeframeのフォーマットを確認してください。
errorMsg8=ファイルが壊れた、サーボモータの範囲を確認してください
errorMsg9=ファイルが壊れた、サーボモータのフォーマットを確認してください
errorMsg10=ファイルが壊れた、フレームのフォーマットを確認してください
errorMsg11=ファイルが壊れた、遅延時間のフォーマットを確認してください
errorMsg12=名前の先頭が必ず英語で付ける、そしてスペシャルマークは無理。
errorMsg13=名前の長さは二十以下。
errorMsg14=名前の中にwhite spaceを付けるは無理。
errorMsg15=正確な遅延時間を設定してください。
errorMsg16=せめてひとつのアクションを編集してください。
errorMsg17=背景画像を開くことができない。
errorMsg18=86Duinoとの連結が失敗しました、オフラインモードを実行します。
errorMsg19=実数を入力してください。
errorMsg20=IMU モジュールを86Duinoに接続して、ロボット コンフィギュレーションに 初期化してください。
errorMsg21=IMU の初期化に失敗しました
errorMsg22=同じ名前の動きもう存在します。
errorMsg23=ミラーファイルが開けない、ファイルを確認してください。
errorMsg24=エラー、このファイルのバージョンは86ME_v
errorMsg25=ファイルが壊れた、IMUのフォーマットを確認してください。
errorMsg26=この名前もう使った。
errorMsg27=この変数/指令が使ってる。
ESP8266BaudCombo_ToolTip=ESP8266のボーレートを選んでください。
ESP8266KeyText_ToolTip=ESP8266で選んだの動きを起こすために、文字列を設定します。
ESP8266PortCombo_ToolTip=86DuinoにESP8266で連結するのシリアルポートを選ぶ。
exitToolStripMenuItem_Text=Exit
ExportMotion=動きを輸出
fcheck_ToolTip=このサーボモータを採用します
fast_Text=早い
fileToolStripMenuItem_Text=新しいプロジェクト
flag_xlabel=名前：
fonoff_ToolTip=Sync/Unsync this servo
Generate_Text=Robot Motion Library
GenerateAllInOne_Text=All-In-One Sketch
GenerateFrame_Text=Generate Frame Files
GenerateScratch_Text=Scratch 2.0 Project
Generate_Description=Select a folder for the Robot Motion Library:
GenerateAllInOne_Description=Select a folder for the All-In-One Sketch:
GenerateFrame_Description=Select a folder for the Frame Files:
GenerateScratch_Description=Select a folder for the Scratch 2.0 Project:
getAccData_Text=オート　ディテクト
goto_xlabel=ターゲット：
goto_xlabel2=作動
goto_xlabel3=何回を実行：
goto_xlabel4=永久に
gotoMotion_xlabel=ターゲット：
gotoMotion_xlabel2=方法：
gotoMotion_xlabel3=ターゲット動きへ飛ぶ、そして元動きへ戻す。（再帰呼出すのことができない）
gotoMotion_xlabel4=今の動きをキャンセルして、ターゲット動きへ飛ぶ。
gotoMotion_xlabel5=***この動きがレイヤー０とスケッチを生成のときに作動します、レイヤー１とテストモードに作動しません。***
helpToolStripMenuItem_Text=ヘルプ
Hint_groupBox_Text=ヒント
hint1=\t"+"ボタンをクリックして、新しい動きを作ります --->
hint2=サーボモータの数字を設定する\n↓\n↓\n↓
hint3=1.クリック\"Ch XX\" そして好きな位置へ移動する。\n2.サーボモータの数字を設定してください。\n↓\n↓
hint4=Homeframe が編集->ロボット コンフィギュレーションに設定することができます。
hint5=\n<--- 遅延時間を設定してください
hint6=フラグの名前を設定してください\n↓\n↓\n↓
hint7=ターゲットフラグと飛ぶ回数を設定してください。\n↓\n↓\n↓
hint8=ターゲット動きとメソッドを設定してください\n↓\n↓\n↓
hint9=\n\n\n\t   この動きを起こすの条件を設定してください--->
hint10=ターゲットフラグの名前を設定してください\n↓\n↓\n↓
hint11=\n\n\n開いた場所で右ボタンを押して、新しいアクションを付け加える。 --->
hint12=\n\n      使ってるサーボはこの機能をサポートしない。
hint13=\n\n\n\t   動きの特性を設定してください設定動作屬性 --->
hint14=\n\n\tこのアクションが全部のサーボを釈放します！
hint15=公式と変数を設定してください\n↓\n↓\n↓
hint16=条件式とフラク名前を設定してください。\n↓\n↓\n↓
howToUseToolStripMenuItem_Text=チュートリアル
ImportMotion=動きをインポート
InsertIntermediateFrame=平均フレームを挿入する。
jump_radioText=ターゲット動きを飛ぶ。
Keyboard_groupBox_Text=キーボード
KeyboardTypeCombo_ToolTip=First Press: キーボードを押された時に起こすの初めのキーコード。\nPressed: キーコードをホールドときに起こす。\nRelease: キーボードを離すときに起こす。
Main_label1_Text=アクション　タイプ：
Main_label2_Text=遅延：
Label2TextDelay=遅延：
Label2TextPlayTime=実行タイム：
languageToolStripMenuItem_Text=言語
loadFrame_ToolTip=フレームファイルを開く、そして今のフレームを設定する。
loadedText= ロード完了。
Motion_groupBox_Text=動き
motion_pause_ToolTip=中止、再生したい時にはもう一度放送ボタンを押してください。
motionLayerExplanation_Text=このフィーチャーは違うのレイヤーに同じの動きを作動することができます。レイヤー１の優先権がレイヤー０より高い。
motion_stop_ToolTip=とどめる
MotionNameLabel_Text=動きの名前：
MotionProperty_Text=特性
MotionPropertyLabel_Text=今の動きの特性を設定する：
MotionTest_ToolTip=選ばれるの動きを放送します。
MotionTrigger_Text=起こす条件
motorRelease_Text=サーボを釈放
motorRelease_ToolTip=注意！このボタンは全てのサーボモータを釈放する。
move_down_ToolTip=アクションを下へ移動する
move_up_ToolTip=アクションを上へ移動する
Action_add_ToolTip=Create a new Instruction for editing.
Action_del_ToolTip=Delete this Instruction.
MoveActionDOWN=下がる
MoveActionUP=上げる
NewMotion_Text=作る
NewMotion_ToolTip=新しい動きリスト
newToolStripMenuItem_Text=ファイル
nonblockinExplanation_Text=この動きが他の動きに中断されることができます。
optionsToolStripMenuItem_Text=編集
preferenceToolStripMenuItem_Text=プリファレンス
ps2_groupBox_Text=PS2 コントローラー
ps2ATTCombo_Text=ATTピンを設定する。
ps2CLKCombo_Text=CLKピンを設定する。
ps2CMDCombo_Text=CMDピンを設定する。
ps2DATCombo_Text=DATピンを設定する。
ps2TypeCombo_ToolTip=First Press: First Press: PS2ボタンを押された時に起こすの初めのキーコード。\nPressed: キーコードをホールドときに起こす。\nRelease: PS2ボタンを離すときに起こす。
RenameMotion=動きをリネーム
saveAsFileToolStripMenuItem_Text=別名で保存
saveFileToolStripMenuItem_Text=保存
saveFrame_ToolTip=今のフレームを保存する。
saveMsg=変更を保存する？
saveMsg2=プロゼェクトを保存する？
Setting_groupBox_Text=設定を編集する
slow_Text=遅い
sync_speed_ToolTip=同期したのサーボモータのスピードを設定する
TitleMotion_ToolTip=この動きが86Duinoを始動するときに一回だけ実行する。
variablesToolStripMenuItem_Text=変数を編集する
warning1=動きを削除してもよろしいですか？
wifi602PortCombo_ToolTip=86Duinoにwifiで連結するのシリアルポートを選ぶ。

# NewMotion
NewMotion_title=ロボット コンフィギュレーション
NewMotion_button3_Text=ロボットの写真を開く
NewMotion_button4_Text=ミラーコンフィグを開く
NewMotion_checkBox2_Text=Min / Max
NewMotion_fcheckText=同期
NewMotion_getQ_Text=オリエンテーションをディテクト
NewMotion_init_imu_Text=IMUを初期化
NewMotion_label1_Text=86Duino board: 
NewMotion_label2_Text=Offset (-256~255)
NewMotion_label3_Text=Home position
NewMotion_label4_Text=IMUを選ぶ:
NewMotion_label5_Text=Base Orientation：
NewMotion_err1=エラー：\n86Duino　Boardまだ選ばない
NewMotion_button4_ToolTip=サーボとサーボの間にのペアワイズ関係を含むのミラーファイルを開く
NewMotion_fcheck_ToolTip=サーボモータを同期する、そして右の数字で作動する。
NewMotion_minMax_ToolTip=Enable/Disableサーボモータの範囲を変更すること。
NewMotion_loadpic_ToolTip=ロボットの写真を開いて、サーボモータの位置を対応付ける。

# SetForm
SetForm_button2_Text=Start
SetForm_Exit_Text=Exit
SetForm_textBox1_Text=86Duinoと連接するのポートを選んでください。